# სიის შექმნა
my_list = ["apple", "banana", 10, 20, 3.14, 2.71, True, False, [1, 2, 3], ["a", "b", "c"]]

# slicing ორი რიცხვით
sliced_list_2 = my_list[2:8]
print(sliced_list_2)

# slicing სამი რიცხვით
sliced_list_3 = my_list[1:9:2]
print(sliced_list_3)

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

# სიას მივაქციოთ და დაბეჭდოთ
reversed_list = my_list[::-1]
print(reversed_list)

# ორი ინდექსის გაწერის მაგალითები
print(my_list[0:4])   # პირველი ელემენტიდან მეოთხე ელემენტამდე
print(my_list[3:7])   # მეოთხედან მეშვიდემდე
print(my_list[3:])    # მეოთხედან ბოლო ელემენტამდე
print(my_list[6:-1])  # მეშვიდედან წინა ელემენტამდე
print(my_list[2:-2])  # მეორედან ერთი ელემენტამდე

# ორი ინდექსის და ნაბიჯის გაწერის მაგალითები
print(my_list[0:15:2])  # პირველი ელემენტიდან ბოლო ელემენტამდე, ნაბიჯი 2
print(my_list[0:15:3])  # პირველი ელემენტიდან ბოლო ელემენტამდე, ნაბიჯი 3
print(my_list[::-1])    # ბოლო ელემენტიდან პირველი ელემენტამდე, ნაბიჯი -1
print(my_list[4::-1])   # მეხუთედან პირველი ელემენტამდე, ნაბიჯი -1
print(my_list[3:9:2])   # მეოთხედან მეცხრამდე, ნაბიჯი 2

# ერთი ინდექსის და ორწერტილის გაწერის მაგალითები
print(my_list[0:])   # პირველი ელემენტიდან ბოლო ელემენტამდე
print(my_list[3:])   # მეოთხედან ბოლო ელემენტამდე
print(my_list[6:])   # მეშვიდედან ბოლო ელემენტამდე
print(my_list[-4:])  # ბოლო ოთხი ელემენტი
print(my_list[-6:])  # ბოლო ექვსი ელემენტი

# თავდაპირველი სია
my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

# 1. ბოლო სამი ელემენტი:
last_three = my_list[-3:]

# 2. მეხუთე ელემენტიდან ბოლომდე:
from_fifth_to_end = my_list[-6:]

# 3. ყველა ელემენტი მეოთხეს გამორიცხვით:
except_fourth = my_list[:-6] + my_list[-5:]

# 4. მეექვსედან მერვემდე:
sixth_to_eighth = my_list[-5:-2]

# 5. ყველა ელემენტი:
all_elements = my_list[:]
