# შექმენით ფუნქცია, რომელიც წაშლის დუპლიკატებს სიისგან
def no_duplicates(user_list):
    return list(set(user_list))

# გამოიძახეთ ფუნქცია 3 განსხვავებული არგუმენტით
list1 = [1, 2, 3, 2, 4]
list2 = [6, 7, 6, 8, 9, 8]
list3 = [10, 10, 11, 12, 11]

print("უფლებების გარეშე სია 1:", no_duplicates(list1))
print("უფლებების გარეშე სია 2:", no_duplicates(list2))
print("უფლებების გარეშე სია 3:", no_duplicates(list3))
 
 # შექმენით tuple, სადაც შეინახება 5 რიცხვი
numbers = (3, 6, 2, 6, 8)

# დაბეჭდეთ ამ tuple-ის მინიმალური და მაქსიმალური მნიშვნელობები
print("მინიმალური მნიშვნელობა:", min(numbers))
print("მაქსიმალური მნიშვნელობა:", max(numbers))

# დაბეჭდეთ ამ tuple-ის პირველი ელემენტი tuple-ში რამდენჯერ გვხვდება
print("პირველი ელემენტი '3'-ის გამეორების რაოდენობა:", numbers.count(numbers[0]))
